<?php
/*-------------------------------------------------------+
| mSchool V2
| Copyright (C) 2011 - 2012 Христо Димитров & Ясен Георгиев
| http://www.mschool.shareit.bg/
+--------------------------------------------------------+
| Име на файла: 403.php
+--------------------------------------------------------+
| Тази програма се реализира като свободен софтуер
| под лиценза Affero GPL. Вие можете да разпространявате
| и/или да модифицирате mSchool V2 под правилата на GNU/GPL.
| Лиценза можете да го прочете във файла license.txt.
| Ако искате да премахнете текста кой е създал системата,
| трява да се свържeте със създателите на mSchool V2.
+--------------------------------------------------------*/

// Вземаме съдържанието на include/siteview.php
include 'includes/SiteView.php';
$SiteView=new SiteView();
// Казваме да искара HTML-а преди съдържанието
$SiteView->top('Достъпът забранен');
// Самото съдържание
$SiteView->errorPage('<h2>Достъпът е забранен!</h2><b>Здравейте! Изглежда, че нямате достъп до тази страница!</b>');
//Показваме футъра
$SiteView->footer();
?>