<?php
/*-------------------------------------------------------+
| mSchool V2
| Copyright (C) 2011 - 2012 Христо Димитров & Ясен Георгиев
| http://www.mschool.shareit.bg/
+--------------------------------------------------------+
| Име на файла: captcha.php
+--------------------------------------------------------+
| Тази програма се реализира като свободен софтуер
| под лиценза Affero GPL. Вие можете да разпространявате
| и/или да модифицирате mSchool V2 под правилата на GNU/GPL.
| Лиценза можете да го прочете във файла license.txt.
| Ако искате да премахнете текста кой е създал системата,
| трява да се свържeте със създателите на mSchool V2.
+--------------------------------------------------------*/

session_start(); //стартираме сесията
$captcha = rand(10000, 99999);

//генерираме случайно петцифрено число с фукцията rand. Тя приема два параметъра. Първи е началното число, втория крайното число. Така ще генерира случайно число, което се намира между тези двете.

$code = md5($captcha);

//хешираме данните чрез md5 функцията
$_SESSION['captcha'] = $code;

//вкарваме всичко в сесия $_SESSION['captcha']

$width = 90;
$height = 35;

$image = imagecreate($width, $height);

//Използваме функцията imagecreate() за да създадем изображението.

$background = imagecolorallocate($image, 99, 175, 255);
$foreground = imagecolorallocate($image, 245, 245, 245);

//задаване фона на снимката (в случая $background) и цвета на текста ($foreground). Сложил съм примерни имена на променливите.

imagestring($image, 20, 20, 12, $captcha, $foreground);

header('Content-type: image/jpeg');

//задаваме content-type да е image/jpeg или според типа на изображението. Много е важно да бъде зададен. 

imagejpeg($image);
imagedestroy($image);
?>