<?php
/*-------------------------------------------------------+
| mSchool V2
| Copyright (C) 2011 - 2012 Христо Димитров & Ясен Георгиев
| http://www.mschool.shareit.bg/
+--------------------------------------------------------+
| Име на файла: index.php
+--------------------------------------------------------+
| Тази програма се реализира като свободен софтуер
| под лиценза Affero GPL. Вие можете да разпространявате
| и/или да модифицирате mSchool V2 под правилата на GNU/GPL.
| Лиценза можете да го прочете във файла license.txt.
| Ако искате да премахнете текста кой е създал системата,
| трява да се свържeте със създателите на mSchool V2.
+--------------------------------------------------------*/

// Стартираме сесия
session_start();
// Унищожаване на сесията
session_destroy();
// Ако няма GET параметър page
if (!isset($_GET['page'])) {
    $page = 'login.php';
} else { //Ако обаче има GET параметър page
    $page = $_GET['page'];
}
// Препраща към $page
header('Location: ' . $page);
?>