<?php
/*-------------------------------------------------------+
| mSchool V2
| Copyright (C) 2011 - 2012 Христо Димитров & Ясен Георгиев
| http://www.mschool.shareit.bg/
+--------------------------------------------------------+
| Име на файла: admin/about.php
+--------------------------------------------------------+
| Тази програма се реализира като свободен софтуер
| под лиценза Affero GPL. Вие можете да разпространявате
| и/или да модифицирате mSchool под правилата на GNU/GPL.
| Лиценза можете да го прочете във файла license.txt.
| Ако искате да премахнете текста кой е създал системата,
| трява да се свържeте със създателите на mSchool.
+--------------------------------------------------------*/

// Вземаме съдържанието на ../include/adminview.php
include '../includes/AdminView.php';
$AdminView=new AdminView();
// Казваме да искара HTML-а преди съдържанието
$AdminView->top('За проекта');
// Съдържание
echo '<p>Проектът mSchool е създаден от <a href="mailto:fix288@gmail.com">Христо Димитров</a> и <a href="mailto:avbincco@gmail.com">Ясен Георгиев</a>.</p> <p>Началото на проекта е през ноември 2011 Година. Плановете на авторите бяха да бъде уеб приложение, което да помага за информационното управление на училищата. Дизайна на сайта е писан лично от тях. За облик на администраторския панел те избраха да бъде интерфейса на Microsoft<sup>®</sup> Windows 7, за да може потребителите да се ориентират по-бързо. Използваните езици за програмиране са PHP, HTML, CSS, JavaScript, jQuery и MySQL. За да улеснят работата си, момчетата използваха NetBeans IDE 7.0.1 и phpMyAdmin.</p> <p>Христо Димитров и Ясен Георгиев смятат, че mSchool е едно прекрасно приложение, което се използва много лесно. Инсталацията му продължава няколко секунди.</p>';
//Показваме футъра
$AdminView->footer();
?>